Revit 2024 API
AnalysisDisplayDiagramSettings.OutlineLineWeight Property
 Line weight of outline and fence lines in the diagram.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int OutlineLineWeight { get; set; }
Visual Basic
Public Property OutlineLineWeight As Integer
	Get
	Set
Visual C++
public:
property int OutlineLineWeight {
	int get ();
	void set (int value);
}
See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace